<a href="https://colab.research.google.com/github/etegaurav/Projects/blob/master/Extract_PDF_information_using_google_colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Python program to extract tabular information from a pdf**
## This notebook was created in Google Colaboratory in order to overcome the dependencies for 'TABULA' library

### Loading the dependent libraries required for the project
### i) Tabula
### ii) Pandas

In [0]:
!pip install -q tabula-py

In [0]:
import tabula
import pandas as pd
pd.set_option('display.max_rows',100)
pd.set_option('display.max_columns',100)

### The pdf was downloaded from the below link and uploaded into Colab and then was used for reading.
#### http://www.airindia.in/images/pdf/Mission-Vande-phase-3-schedule.pdf

In [0]:
# Extraction of data from input.pdf file
input_pdf = '/content/input.pdf'
df = tabula.read_pdf(input_pdf,pages='all')

### The data upon loading, gets stored as a list of dataframes
### Each dataframe can be accessed through list index

In [89]:
# The length function gives us the number of dataframes present in the list
len(df)
# Using the type() to confirm the type of element of the list 
type(df[0])

pandas.core.frame.DataFrame

### Exploring the shape of each of the dataframes in order to find the number of rows and columns

In [90]:
# using a for loop to explore the shape of the dataframe
for i in range(len(df)):
  print(f'Shape of the dataframe {i} is: ',df[i].shape)

Shape of the dataframe 0 is:  (21, 8)
Shape of the dataframe 1 is:  (38, 8)
Shape of the dataframe 2 is:  (38, 8)
Shape of the dataframe 3 is:  (38, 8)
Shape of the dataframe 4 is:  (38, 8)
Shape of the dataframe 5 is:  (32, 8)
Shape of the dataframe 6 is:  (34, 8)
Shape of the dataframe 7 is:  (38, 8)
Shape of the dataframe 8 is:  (38, 8)
Shape of the dataframe 9 is:  (38, 8)
Shape of the dataframe 10 is:  (38, 8)
Shape of the dataframe 11 is:  (38, 8)
Shape of the dataframe 12 is:  (38, 8)
Shape of the dataframe 13 is:  (38, 8)
Shape of the dataframe 14 is:  (38, 8)
Shape of the dataframe 15 is:  (20, 8)

### Exploring the data present in the dataframe

In [91]:
# Exploring few rows of the first dataframe (first element of the list)
df[0].head(5)

,Unnamed: 0,DEPARTURE,Unnamed: 1,DEPARTURE.1,DEPARTURE.2,ARRIVAL,ARRIVAL.1,ARRIVAL.2
0,SNO,NaN,FLIGHT,NaN,NaN,NaN,NaN,NaN
1,NaN,DATE,NaN,STATION,TIME,STATION,TIME,DATE
2,1,10-Jun-20,AI 0931,MUMBAI,06:25,JEDDAH,09:00,10-Jun-20
3,2,10-Jun-20,AI 1929,MUMBAI,07:45,DAMMAM,09:00,10-Jun-20
4,3,10-Jun-20,AI 1953,BANGALURU,08:00,RIYADH,10:20,10-Jun-20

### Observation # 1: The Column names have to be corrected
### Observation # 2: The dataset contains rows with Null values

## Let's explore further .....

In [92]:
# Exploring few rows of the last dataframe (last element in the list)
df[-1].head(5)

,SNO,DEPARTURE\rDATE,FLIGHT,DEPARTURE\rSTATION,DEPARTURE\rTIME,ARRIVAL\rSTATION,ARRIVAL\rTIME,ARRIVAL\rDATE
0,337,30-Jun-20,AI 1934,DELHI,05:00,LUCKNOW,06:00,30-Jun-20
1,338,30-Jun-20,AI 1928,DELHI,05:30,BHOPAL,07:00,30-Jun-20
2,339,29-Jun-20,AI 0188,TORONTO,12:15,DELHI,12:15,30-Jun-20
3,340,29-Jun-20,AI 0144,NEWARK,12:05,MUMBAI,12:25,30-Jun-20
4,341,29-Jun-20,AI 0126,CHICAGO,12:00,DELHI,13:05,30-Jun-20

In [93]:
for i in range(len(df)):
  print(f'Index {i}',df[i].columns)

Index 0 Index(['Unnamed: 0', 'DEPARTURE', 'Unnamed: 1', 'DEPARTURE.1', 'DEPARTURE.2',
       'ARRIVAL', 'ARRIVAL.1', 'ARRIVAL.2'],
      dtype='object')
Index 1 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 2 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 3 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 4 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 5 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 6 Index(['Unnamed: 0', 'DEPARTURE', 'Unnamed: 1', 'DEPARTURE.1', 'DEPARTURE.2',
       'ARRIVAL', 'ARRIVAL.1', 'ARRIVAL.2'],
      dtype='object')
Index 7 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 8 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 9 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 10 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 11 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 12 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 13 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 14 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')
Index 15 Index(['SNO', 'DEPARTURE\rDATE', 'FLIGHT', 'DEPARTURE\rSTATION',
       'DEPARTURE\rTIME', 'ARRIVAL\rSTATION', 'ARRIVAL\rTIME',
       'ARRIVAL\rDATE'],
      dtype='object')

### Observation 3: The label have to be fixed as well.

In [94]:
# Checking for total number of records in all the dataframes present in the list
sum = 0
for i in range(len(df)):
  sum = sum + len(df[i])
print('Num of records: ',sum)

Num of records:  563

## After exploring the dataset, now we can proceed with the cleansing of the data based on the collected observations.

### Correction #1 - Fixing the column names
This will be a 2 step process:
1. Concating the similar dataframes.
2. Fixing the column names.

In [0]:
"""
# The 1st and the 7th element have different column structure from the rest of the elements of the list
"""
df_1_6 = pd.concat([df[0],df[6]]) # concating the first and 7th element

In [0]:
"""
# The rest of the elements have similar column structure and hence can be concatenated.
# As the list created after read the pdf is a list of dataframes
# therefore they can be concatenated
"""
df_2 = pd.concat(df[1:6]) # concating 2nd to 6th element
df_3 = pd.concat(df[7:len(df)])  #concating 8th to last element
df_rest = pd.concat([df_2,df_3]) #concating all elements excluding 1st and 7th element

In [97]:
# checking the number of elements in each of the concatenated dataframes
print(len(df_1_6))
print(len(df_rest))

55
508

In [98]:
# checking the concatenated dataframes before renaming column names
df_1_6.head(3)

,Unnamed: 0,DEPARTURE,Unnamed: 1,DEPARTURE.1,DEPARTURE.2,ARRIVAL,ARRIVAL.1,ARRIVAL.2
0,SNO,NaN,FLIGHT,NaN,NaN,NaN,NaN,NaN
1,NaN,DATE,NaN,STATION,TIME,STATION,TIME,DATE
2,1,10-Jun-20,AI 0931,MUMBAI,06:25,JEDDAH,09:00,10-Jun-20

In [99]:
# checking the concatenated dataframes before renaming column names
df_rest.head(3)

,SNO,DEPARTURE\rDATE,FLIGHT,DEPARTURE\rSTATION,DEPARTURE\rTIME,ARRIVAL\rSTATION,ARRIVAL\rTIME,ARRIVAL\rDATE
0,20,13-Jun-20,AI 0127,DELHI,02:20,CHICAGO,07:25,13-Jun-20
1,21,13-Jun-20,AI 1905,MUMBAI,06:30,LAGOS,11:50,13-Jun-20
2,22,13-Jun-20,AI 0921,MUMBAI,07:45,RIYADH,09:45,13-Jun-20

In [0]:
# Renaming the columns in order to maintain uniformity
df_1_6.rename(columns={'Unnamed: 0':'SNO',
                       'DEPARTURE':'DEP_DT',
                       'Unnamed: 1':'FLIGHT',
                       'DEPARTURE.1':'DEP',
                       'DEPARTURE.2':'DEP_TIME',
                       'ARRIVAL':'ARR',
                       'ARRIVAL.1':'ARR_TIME',
                       'ARRIVAL.2':'ARR_DT'},inplace=True)

In [0]:
df_rest.rename(columns={'DEPARTURE\rDATE':'DEP_DT',
                          'DEPARTURE\rSTATION':'DEP',
                          'DEPARTURE\rTIME':'DEP_TIME',
                          'ARRIVAL\rSTATION':'ARR',
                          'ARRIVAL\rTIME':'ARR_TIME',
                          'ARRIVAL\rDATE':'ARR_DT'},inplace=True)

In [102]:
# checking the data after renaming columns
print('columns of df_1_6:',df_1_6.columns)
print('columns of df_rest:',df_rest.columns)

columns of df_1_6: Index(['SNO', 'DEP_DT', 'FLIGHT', 'DEP', 'DEP_TIME', 'ARR', 'ARR_TIME',
       'ARR_DT'],
      dtype='object')
columns of df_rest: Index(['SNO', 'DEP_DT', 'FLIGHT', 'DEP', 'DEP_TIME', 'ARR', 'ARR_TIME',
       'ARR_DT'],
      dtype='object')

In [0]:
# After fixing the column names in both the dataset, now we can concatenate the dataframe df_1_6 and df_rest
df_final = pd.concat([df_1_6,df_rest])

In [104]:
# checking the number of records of the final dataframe
len(df_final)

563

# **The below steps will be used in order to handle the Null Values**

In [0]:
# creating a categorical temp column in order to tag null values in the rows
df_final['T/F'] = df_final.isnull().any(axis=1)

In [106]:
# Filtering the dataset in order find the rows with null values
df_final[df_final['T/F']== True]

   SNO DEP_DT  FLIGHT      DEP DEP_TIME      ARR ARR_TIME ARR_DT   T/F
0  SNO    NaN  FLIGHT      NaN      NaN      NaN      NaN    NaN  True
1  NaN   DATE     NaN  STATION     TIME  STATION     TIME   DATE  True
0  SNO    NaN  FLIGHT      NaN      NaN      NaN      NaN    NaN  True
1  NaN   DATE     NaN  STATION     TIME  STATION     TIME   DATE  True

In [0]:
# Modifying the dataframe to store not null values only
df_final = df_final[df_final['T/F'] != True]

In [108]:
df_final

,SNO,DEP_DT,FLIGHT,DEP,DEP_TIME,ARR,ARR_TIME,ARR_DT,T/F
2,1,10-Jun-20,AI 0931,MUMBAI,06:25,JEDDAH,09:00,10-Jun-20,False
3,2,10-Jun-20,AI 1929,MUMBAI,07:45,DAMMAM,09:00,10-Jun-20,False
4,3,10-Jun-20,AI 1953,BANGALURU,08:00,RIYADH,10:20,10-Jun-20,False
5,4,10-Jun-20,AI 1957,DELHI,10:00,RIYADH,12:30,10-Jun-20,False
6,5,11-Jun-20,AI 0127,DELHI,02:20,CHICAGO,07:25,11-Jun-20,False
...,...,...,...,...,...,...,...,...,...
15,352,30-Jun-20,AI 0188,TORONTO,12:15,DELHI,12:15,01-Jul-20,False
16,353,30-Jun-20,AI 0126,CHICAGO,12:00,DELHI,13:05,01-Jul-20,False
17,354,30-Jun-20,AI 0174,SAN FRANCISCO,10:30,DELHI,15:00,01-Jul-20,False
18,355,01-Jul-20,AI 0126,DELHI,15:30,HYDERABAD,17:30,01-Jul-20,False
19,356,01-Jul-20,AI 0174,DELHI,17:00,BANGALURU,19:45,01-Jul-20,False

# **The below steps will be followed in order to fix the labelling of rows**

In [0]:
# defining the row labels in a list
index_lst = list(range(1,len(df_final)+1))

In [0]:
# assigning the row labels to the column
df_final['id']= index_lst

In [111]:
# exploring the final dataframe and checking the id column
df_final.head()

,SNO,DEP_DT,FLIGHT,DEP,DEP_TIME,ARR,ARR_TIME,ARR_DT,T/F,id
2,1,10-Jun-20,AI 0931,MUMBAI,06:25,JEDDAH,09:00,10-Jun-20,False,1
3,2,10-Jun-20,AI 1929,MUMBAI,07:45,DAMMAM,09:00,10-Jun-20,False,2
4,3,10-Jun-20,AI 1953,BANGALURU,08:00,RIYADH,10:20,10-Jun-20,False,3
5,4,10-Jun-20,AI 1957,DELHI,10:00,RIYADH,12:30,10-Jun-20,False,4
6,5,11-Jun-20,AI 0127,DELHI,02:20,CHICAGO,07:25,11-Jun-20,False,5

In [112]:
df_final.tail()

,SNO,DEP_DT,FLIGHT,DEP,DEP_TIME,ARR,ARR_TIME,ARR_DT,T/F,id
15,352,30-Jun-20,AI 0188,TORONTO,12:15,DELHI,12:15,01-Jul-20,False,555
16,353,30-Jun-20,AI 0126,CHICAGO,12:00,DELHI,13:05,01-Jul-20,False,556
17,354,30-Jun-20,AI 0174,SAN FRANCISCO,10:30,DELHI,15:00,01-Jul-20,False,557
18,355,01-Jul-20,AI 0126,DELHI,15:30,HYDERABAD,17:30,01-Jul-20,False,558
19,356,01-Jul-20,AI 0174,DELHI,17:00,BANGALURU,19:45,01-Jul-20,False,559

#### Preparing the dataset by dropping the temporary columns and setting the index

In [0]:
# deleting the temporary categorical column 'T/F'and the 'SNO column
df_final.drop(columns=['T/F','SNO'],inplace =True)
df_final.set_index('id',inplace=True)

In [114]:
df_final

,DEP_DT,FLIGHT,DEP,DEP_TIME,ARR,ARR_TIME,ARR_DT
id,,,,,,,
1,10-Jun-20,AI 0931,MUMBAI,06:25,JEDDAH,09:00,10-Jun-20
2,10-Jun-20,AI 1929,MUMBAI,07:45,DAMMAM,09:00,10-Jun-20
3,10-Jun-20,AI 1953,BANGALURU,08:00,RIYADH,10:20,10-Jun-20
4,10-Jun-20,AI 1957,DELHI,10:00,RIYADH,12:30,10-Jun-20
5,11-Jun-20,AI 0127,DELHI,02:20,CHICAGO,07:25,11-Jun-20
...,...,...,...,...,...,...,...
555,30-Jun-20,AI 0188,TORONTO,12:15,DELHI,12:15,01-Jul-20
556,30-Jun-20,AI 0126,CHICAGO,12:00,DELHI,13:05,01-Jul-20
557,30-Jun-20,AI 0174,SAN FRANCISCO,10:30,DELHI,15:00,01-Jul-20
558,01-Jul-20,AI 0126,DELHI,15:30,HYDERABAD,17:30,01-Jul-20
559,01-Jul-20,AI 0174,DELHI,17:00,BANGALURU,19:45,01-Jul-20

# ** Exporting the dataset into an excel file**

In [0]:
output = df_final.to_excel('output.xlsx')